#+title: HW 4

StudentId, StudentName, GroupId, GroupName, CourseId, CourseName, LecturerId, LecturerName, Mark

* 4
#+header: :engine postgres
#+begin_src sql
CREATE DATABASE hw4;
#+end_src

#+RESULTS:
| CREATE DATABASE |
|-----------------|

#+header: :engine postgres
#+header: :database hw4
#+begin_src sql
DROP TABLE IF EXISTS Students CASCADE;
DROP TABLE IF EXISTS Groups CASCADE;
DROP TABLE IF EXISTS Lecturers CASCADE;
DROP TABLE IF EXISTS Courses CASCADE;
DROP TABLE IF EXISTS Marks CASCADE;
DROP TABLE IF EXISTS Teachers CASCADE;
DROP TABLE IF EXISTS StudentGroups CASCADE;

CREATE TABLE Students (
       Id int GENERATED ALWAYS AS IDENTITY not null,
       Name varchar(50) not null,

       PRIMARY KEY (Id)
);

CREATE TABLE Groups (
       Id int GENERATED ALWAYS AS IDENTITY not null,
       Name varchar(50) not null,

       PRIMARY KEY (Id)
);

CREATE TABLE Lecturers (
       Id int GENERATED ALWAYS AS IDENTITY not null,
       Name varchar(50) not null,

       PRIMARY KEY (Id)
);

CREATE TABLE Courses (
       Id int GENERATED ALWAYS AS IDENTITY not null,
       Name varchar(50) not null,

       PRIMARY KEY (Id)
);

CREATE TABLE Teachers (
       CourseId int not null,
       GroupId int not null,
       LecturerId int not null,
       PRIMARY KEY (CourseId, GroupId),

       FOREIGN KEY (CourseId)
       REFERENCES Courses(Id),

       FOREIGN KEY (GroupId)
       REFERENCES Groups(Id),

       FOREIGN KEY (LecturerId)
       REFERENCES Lecturers(Id)
);

CREATE TABLE Marks (
       CourseId int not null,
       StudentId int not null,
       Mark int not null,
       PRIMARY KEY (CourseId, StudentId),

       FOREIGN KEY (CourseId)
       REFERENCES Courses(Id),

       FOREIGN KEY (StudentId)
       REFERENCES Students(Id)
);

CREATE TABLE StudentGroups (
       GroupId int not null,
       StudentId int not null,
       PRIMARY KEY (StudentId),

       FOREIGN KEY (GroupId)
       REFERENCES Groups(Id)
);
#+end_src

#+RESULTS:
| DROP TABLE   |
|--------------|
| DROP TABLE   |
| DROP TABLE   |
| DROP TABLE   |
| DROP TABLE   |
| DROP TABLE   |
| DROP TABLE   |
| CREATE TABLE |
| CREATE TABLE |
| CREATE TABLE |
| CREATE TABLE |
| CREATE TABLE |
| CREATE TABLE |
| CREATE TABLE |

* 7
#+header: :engine postgres
#+header: :database hw4
#+begin_src sql
INSERT INTO Students (Name) VALUES
       ('Иванов Иван'),
       ('Петров Петр'),
       ('Казимиров Казимир'),
       ('Игнатьев Игнат'),
       ('Тимуров Тимур'),
       ('Станиславов Станислав');
#+end_src

#+RESULTS:
| INSERT 0 6 |
|------------|

#+header: :engine postgres
#+header: :database hw4
#+begin_src sql
INSERT INTO Groups (Name) VALUES
       ('M33371'),
       ('M3133'),
       ('M34391');
#+end_src

#+RESULTS:
| INSERT 0 3 |
|------------|

#+header: :engine postgres
#+header: :database hw4
#+begin_src sql
INSERT INTO Lecturers (Name) VALUES
       ('Корнеев Георгий'),
       ('Кохась Константин'),
       ('Маврин Павел');
#+end_src

#+RESULTS:
| INSERT 0 3 |
|------------|

#+header: :engine postgres
#+header: :database hw4
#+begin_src sql
INSERT INTO Courses (Name) VALUES
       ('Матанализ'),
       ('Базы Данных'),
       ('АиСД');
#+end_src

#+RESULTS:
| INSERT 0 3 |
|------------|


#+header: :engine postgres
#+header: :database hw4
#+begin_src sql
SELECT (Id, NAME) FROM Students;
#+end_src

#+RESULTS:
| row                         |
|-----------------------------|
| (1,"Иванов Иван")           |
| (2,"Петров Петр")           |
| (3,"Казимиров Казимир")     |
| (4,"Игнатьев Игнат")        |
| (5,"Тимуров Тимур")         |
| (6,"Станиславов Станислав") |

#+header: :engine postgres
#+header: :database hw4
#+begin_src sql
SELECT (Id, NAME) FROM Groups;
#+end_src

#+RESULTS:
| row        |
|------------|
| (1,M33371) |
| (2,M3133)  |
| (3,M34391) |

#+header: :engine postgres
#+header: :database hw4
#+begin_src sql
SELECT (Id, NAME) FROM Lecturers;
#+end_src

#+RESULTS:
| row                     |
|-------------------------|
| (1,"Корнеев Георгий")   |
| (2,"Кохась Константин") |
| (3,"Маврин Павел")      |

#+header: :engine postgres
#+header: :database hw4
#+begin_src sql
SELECT (Id, NAME) FROM Courses;
#+end_src

#+RESULTS:
| row               |
|-------------------|
| (1,Матанализ)     |
| (2,"Базы Данных") |
| (3,АиСД)          |

#+header: :engine postgres
#+header: :database hw4
#+begin_src sql
INSERT INTO StudentGroups (StudentId, GroupId) VALUES
       (1, 1),
       (4, 2),
       (3, 1),
       (6, 3);
#+end_src

#+RESULTS:
| INSERT 0 4 |
|------------|

#+header: :engine postgres
#+header: :database hw4
#+begin_src sql
INSERT INTO Teachers (CourseId, GroupId, LecturerId) VALUES
       (1, 2, 2),
       (1, 1, 2),
       (2, 1, 3),
       (3, 1, 3),
       (3, 2, 3);
#+end_src

#+RESULTS:
| INSERT 0 5 |
|------------|


#+header: :engine postgres
#+header: :database hw4
#+begin_src sql
INSERT INTO Marks (CourseId, StudentId, Mark) VALUES
       (1, 1, 2),
       (1, 3, 5),
       (2, 6, 1),
       (3, 2, 10);
#+end_src

#+RESULTS:
| INSERT 0 4 |
|------------|
